bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Inc/bl808_spp_misc.h
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef __BL808_SPP_MISC_H__
#define __BL808_SPP_MISC_H__

#include <bl808_comm_mm.h>


typedef void(intCallback_Type)(void);

typedef enum {
    DVP_TSRC_PIX_FROM_SPP       = 0,
    DVP_TSRC_PIX_FROM_SENSOR    = 1,
} SPP_DVP_TSRC_PIX_SEL_E;

typedef enum {
    DVP_TSRC_SRC_DVP         = 0,
    DVP_TSRC_SRC_MIPI_CSI    = 1,
} SPP_DTSRC_SRC_E;

typedef enum {
    DVP2AXI_ID_BAYER   = 0,
    DVP2AXI_ID_YUV     = 1,
} DVP2AXI_ID_E;

typedef enum {
    DVP2AXI_SRC_SPP_INPUT              = 0,
    DVP2AXI_SRC_RESERVE0               = 0x1,
    DVP2AXI_SRC_SCALER_FOR_CODEC       = 0x2,
    DVP2AXI_SRC_CODEC_YUV420           = 0x3,
    DVP2AXI_SRC_RESERVE1_OUT           = 0x8,
    DVP2AXI_SRC_RESERVE2               = 0x9,
    DVP2AXI_SRC_RESERVE3               = 0xa,
    DVP2AXI_SRC_RESERVE4_R             = 0xb,
    DVP2AXI_SRC_RESERVE4_G             = 0xc,
    DVP2AXI_SRC_RESERVE4_B             = 0xd,
    DVP2AXI_SRC_RESERVE5_R             = 0xe,
    DVP2AXI_SRC_RESERVE5_G             = 0xf,
    DVP2AXI_SRC_RESERVE5_B             = 0x10,
    DVP2AXI_SRC_RESERVE6_GR            = 0x11,
    DVP2AXI_SRC_RESERVE6_BG            = 0x12,
    DVP2AXI_SRC_RESERVE7_OUT           = 0x19,
    DVP2AXI_SRC_YUV_CONTROL_CB_Y       = 0x1a,
    DVP2AXI_SRC_YUV_CONTROL_CR_CB      = 0x1b,
    DVP2AXI_SRC_RESERVE7               = 0x1d,
    DVP2AXI_SRC_SPP_OUTPUT             = 0x1e,
    DVP2AXI_SRC_SCALER_FOR_HDMI        = 0x1f,
    DVP2AXI_SRC_OFF                    = 0x20,
} DVP2AXI_Src_Type;


/**
 *  @brief Input V/H sync active level type definition
 */
typedef enum {
    SPP_MISC_ACTIVE_HIGH, /*!< Input is active-high */
    SPP_MISC_ACTIVE_LOW,  /*!< Input is active-low */
}SPP_MISC_Active_Level_Type;

/**
 *  @brief DVP 2X input data order type definition
 */
typedef enum {
    SPP_MISC_2X_DATA_BYTE_LOWER,  /*!< The first data is lower-byte */
    SPP_MISC_2X_DATA_BYTE_HIGHER, /*!< The first data is higher-byte */
}SPP_MISC_2X_Data_Order_Type;

/**
 *  @brief DVP input V/H sync active level type definition
 */
typedef enum {
    DVP_ACTIVE_HIGH,                         /*!< Input is active-high */
    DVP_ACTIVE_LOW,                          /*!< Input is active-low */
}DVP_Active_Level_Type;

/**
 *  @brief DVP input data order type definition
 */
typedef enum {
    DVP_DATA_BYTE_LOWER,                     /*!< The first data is lower-byte */
    DVP_DATA_BYTE_HIGHER,                    /*!< The first data is higher-byte */
}DVP_Data_Order_Type;

/**
 *  @brief DVP as 2x configuration strcut definition
 */
typedef struct {
    SPP_MISC_Active_Level_Type hSyncLevel;        /*!< Input H-Sync active level */
    SPP_MISC_Active_Level_Type vSyncLevel;        /*!< Input V-Sync active level */
    SPP_MISC_2X_Data_Order_Type dataOrder;        /*!< Input data order */
    uint16_t fifoThreshold;                       /*!< Fifo threshold for each DVP line to start to
                                                  output,((Width-Fifo_th)*T_in*2)<(Width*T_out)<((Width-Fifo_th)*T_in*2+Blank*T_in) */
}DVP_2x_Cfg_Type;

/*
    SEOF number
 */
typedef enum {
    SPP_SEOF0 = 0,
    SPP_SEOF1,
    SPP_SEOF2,
    SPP_SEOF3,
    SPP_SEOF4,
    SPP_SEOF_NUM,
}SPP_SEOF_E;

typedef enum {
    SEOF_INTR_SRC_SENSOR_VSYNC = 0,
    SEOF_INTR_SRC_SPP_ACT_VSYNC = 1,
    SEOF_INTR_SRC_SPP_OUT_VSYNC = 2,
    SEOF_INTR_SRC_DTSRC_VSYNC = 3,
    SEOF_INTR_SRC_INVALID,
} SPP_Seof_Intr_Src_Type;

typedef enum {
    SPP_DVP_10_BIT = 0,
    SPP_DVP_12_BIT = 1,
} SPP_DVP_BIT_DEPTH_E;

typedef enum {
    SPP_SCALER_A,
    SPP_SCALER_B,
    SPP_SCALER_C,
    SPP_SCALER_D,
} SPP_Scaler_Type;

typedef enum {
    SPP_YUV_ADJUST_A,
    SPP_YUV_ADJUST_B,
    SPP_YUV_ADJUST_C,
    SPP_YUV_ADJUST_D,
} SPP_YUV_Adjust_Type;

typedef enum {
    SPP_YUV_ADJUST_INPUT_SPP_OUTPUT ,
    SPP_YUV_ADJUST_INPUT_SPP_INPUT,
    SPP_YUV_ADJUST_INPUT_OSD_A,
    SPP_YUV_ADJUST_INPUT_OSD_B,
    SPP_YUV_ADJUST_INPUT_OSD_C,
    SPP_YUV_ADJUST_INPUT_OSD_D,
    SPP_YUV_ADJUST_INPUT_SCALER_A,
    SPP_YUV_ADJUST_INPUT_SCALER_B,
    SPP_YUV_ADJUST_INPUT_SCALER_C,
    SPP_YUV_ADJUST_INPUT_SCALER_D,
    SPP_YUV_ADJUST_INPUT_DVP_2x,
} SPP_YUV_Adjust_Input;

/**
 *  @brief OSD id type definition
 */
typedef enum {
    SPP_MISC_OSD_0_ID,                       /*!< OSD 0 port define */
    SPP_MISC_OSD_1_ID,                       /*!< OSD 1 port define */
    SPP_MISC_OSD_2_ID,                       /*!< OSD 2 port define */
    SPP_MISC_OSD_3_ID,                       /*!< OSD 3 port define */
    SPP_MISC_OSD_ID_MAX,                     /*!< OSD max ID define */
}SPP_MISC_OSD_ID_Type;

/**
 *  @brief OSD input type definition
 */
typedef enum {
    SPP_MISC_OSD_SPP_OUTPUT,                 /*!< Use SPP output as OSD input */
    SPP_MISC_OSD_SPP_INPUT,                  /*!< Use SPP input as OSD input */
    SPP_MISC_OSD_SCALER_0_OUTPUT,            /*!< Use scaler 0 as OSD input */
    SPP_MISC_OSD_SCALER_1_OUTPUT,            /*!< Use scaler 1 as OSD input */
    SPP_MISC_OSD_SCALER_2_OUTPUT,            /*!< Use scaler 2 as OSD input */
    SPP_MISC_OSD_SCALER_3_OUTPUT,            /*!< Use scaler 3 as OSD input */
    SPP_MISC_OSD_OSD_0_OUTPUT,               /*!< Use osd 0 as OSD input, only osd 1/osd 3 support */
    SPP_MISC_OSD_DVP_2X_OUTPUT,              /*!< Use dvp 2x as OSD input */
    SPP_MISC_OSD_INPUT_MAX,                  /*!< OSD input max ID define */
}SPP_MISC_OSD_Input_Type;
/**
 *  @brief OSD Pb input type definition
 */
typedef enum {
    SPP_MISC_OSD_PB_SPP_OUTPUT,                 /*!< Use SPP output as OSD input */
    SPP_MISC_OSD_PB_SPP_INPUT,                  /*!< Use SPP input as OSD input */
    SPP_MISC_OSD_PB_MAX,                        /*!< OSD PB max ID define */
}SPP_MISC_OSD_PB_Input_Type;

