bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Inc/bl808_spp_misc.h
typedef enum {
    SPP_OSD_A,
    SPP_OSD_B,
    SPP_OSD_C,
    SPP_OSD_D,
} SPP_OSD_Type;

typedef enum {
    SPP_YUV2RGB_A,
} SPP_YUV2RGB_Type;

typedef enum {
    SPP_SCALER_INPUT_SPP_OUTPUT ,
    SPP_SCALER_INPUT_SPP_INPUT,
    SPP_SCALER_INPUT_OSD_A,
    SPP_SCALER_INPUT_OSD_B,
    SPP_SCALER_INPUT_OSD_C,
    SPP_SCALER_INPUT_OSD_D,
    SPP_SCALER_DVP_2X,
} SPP_Scaler_Input;

/**
 *  @brief Crop configuration strcut definition
 */
typedef struct {
    uint16_t hsyncStart;                     /*!< Hsync valid start */
    uint16_t hsyncEnd;                       /*!< Hsync valid end */
    uint16_t vsyncStart;                     /*!< Vsync valid start */
    uint16_t vsyncEnd;                       /*!< Vsync valid end */
}SPP_MISC_Crop_Cfg_Type;

typedef enum {
    SPP_OSD_INPUT_SPP_OUTPUT ,
    SPP_OSD_INPUT_SPP_INPUT,
    SPP_OSD_INPUT_SCALER_A,
    SPP_OSD_INPUT_SCALER_B,
    SPP_OSD_INPUT_SCALER_C,
    SPP_OSD_INPUT_SCALER_D,
    SPP_OSD_INPUT_OSD_A,
    SPP_OSD_INPUT_OSD_C,
} SPP_OSD_Input;

typedef enum {
    SPP_YUV2RGB_INPUT_SPP_OUTPUT,
    SPP_YUV2RGB_INPUT_SPP_INPUT,
    SPP_YUV2RGB_INPUT_OSD_A,
    SPP_YUV2RGB_INPUT_OSD_B,
    SPP_YUV2RGB_INPUT_OSD_C,
    SPP_YUV2RGB_INPUT_OSD_D,
    SPP_YUV2RGB_INPUT_SCALER_A,
    SPP_YUV2RGB_INPUT_SCALER_B,
    SPP_YUV2RGB_INPUT_SCALER_C,
    SPP_YUV2RGB_INPUT_SCALER_D,
    SPP_YUV2RGB_INPUT_DVP_2X,
    SPP_YUV2RGB_INPUT_DISABLED,
} SPP_YUV2RGB_Input;

typedef enum {
    SPP_YUV2RGB_PARAM_8BIT_BT601 = 0,
    SPP_YUV2RGB_PARAM_MAX,
} SPP_YUV2RGB_Param;

typedef struct blSPP_DVP2AXI_SRC_SEL_S {
    DVP2AXI_Src_Type data[DVP2AXI_NUM];
} SPP_DVP2AXI_SRC_SEL_S;

typedef struct blSPP_SCALER_CONFIG_S {
    BL_Img_Size_T input;
    BL_Img_Size_T output;
} SPP_SCALER_CONFIG_S;

typedef struct blSPP_FRAME_M_TO_N_S {
    BL_Fun_Type enb;
    int m;
    int n;
    int intv;
} SPP_FRAME_M_TO_N_S;

struct yuv2rgb_param_t {
    int pre_offset_0;
    int pre_offset_1;
    int pre_offset_2;
    int post_offset_0;
    int post_offset_1;
    int post_offset_2;
    int matrix_00;
    int matrix_01;
    int matrix_02;
    int matrix_10;
    int matrix_11;
    int matrix_12;
    int matrix_20;
    int matrix_21;
    int matrix_22;
};

/**
 *  @brief Bayer data shift direction type definition
 */
typedef enum {
    SPP_MISC_BAYER_SHIFT_LEFT,               /*!< Bayer data shift left */
    SPP_MISC_BAYER_SHIFT_RIGHT,              /*!< Bayer data shift right */
}SPP_MISC_Bayer_Shift_Type;

/**
 *  @brief Display input type definition
 */
typedef enum {
    SPP_MISC_DISPLAY_YUV2RGB_OUTPUT,         /*!< Use yuv2rgb output as display input */
    SPP_MISC_DISPLAY_OSD_DP_OUTPUT,          /*!< Use OSD_DP output as display input */
    SPP_MISC_DISPLAY_TSRC_RGB_OUTPUT,        /*!< Use dvp tsrc rgb output as display input */
    SPP_MISC_DISPLAY_TSRC_YUV422_OUTPUT,     /*!< Use dvp tsrc yuv422 output as display input */
}SPP_MISC_Display_Input_Type;

/**
 *  @brief Display OSD input type definition
 */
typedef enum {
    SPP_MISC_DISPLAY_OSD_YUV420TO422_OUTPUT, /*!< Use yuv420to422 output as display OSD input */
    SPP_MISC_DISPLAY_OSD_RGB2YUV422_OUTPUT,  /*!< Use rgb2yuv422 output as display OSD input */
    SPP_MISC_DISPLAY_OSD_TSRCYUV422_OUTPUT,  /*!< Use dvp tsrc yuv422 output as display OSD input */
}SPP_MISC_Display_OSD_Input_Type;

/**
 *  @brief Display configuration structure type definition
 */
typedef struct {
    BL_Fun_Type dpiEnable;                   /*!< Enable or disable dpi function */
    BL_Fun_Type hdmiEnable;                  /*!< Enable or disable hdmi function */
    BL_Fun_Type bt1120Enable;                /*!< Enable or disable BT1120 function, BT1120 and BT656 should not be enabled at the same time */
    BL_Fun_Type bt656Enable;                 /*!< Enable or disable BT656 function, BT1120 and BT656 should not be enabled at the same time */
    SPP_MISC_Display_Input_Type inputType;   /*!< Select display input */
    SPP_MISC_Display_OSD_Input_Type osdType; /*!< Select display OSD input */
    uint8_t hsyncWidth;                      /*!< Horizontal synchronization width */
    uint8_t hfpWidth;                        /*!< Horizontal front porch width */
    uint8_t vsyncWidth;                      /*!< Vertical synchronization width */
    uint8_t vfpWidth;                        /*!< Vertical front porch width */
}SPP_MISC_Display_Cfg_Type;

/**
 *  @brief Display gamma configuration structure type definition
 */
typedef struct {
    BL_Fun_Type ch0Enable;                   /*!< Enable or disable display gamma channel 0 */
    BL_Fun_Type ch1Enable;                   /*!< Enable or disable display gamma channel 1 */
    BL_Fun_Type ch2Enable;                   /*!< Enable or disable display gamma channel 2 */
    uint8_t* gammaCurve;                     /*!< Gamma curve */
}SPP_MISC_Display_Gamma_Cfg_Type;

typedef struct {
    uint16_t y_luma;
    uint16_t y_mul0;
    uint16_t y_mul1;
    uint8_t y_min;
    uint8_t y_max;
    uint16_t uv_mul0;
    uint16_t uv_mul1;
    uint8_t uv_min;
    uint8_t uv_max;
}SPP_YUV_Adjust_Cfg_Type;

/**
 *  @brief YUV2RGB configuration strcut definition
 */
typedef struct {
    BL_Fun_Type enable;                      /*!< Enable or disable yuv2rgb function */
    uint16_t preOffset0;                     /*!< YUV2RGB pre offset 0 */
    uint16_t preOffset1;                     /*!< YUV2RGB pre offset 1 */
    uint16_t preOffset2;                     /*!< YUV2RGB pre offset 2 */
    uint16_t postOffset0;                    /*!< YUV2RGB post offset 0 */
    uint16_t postOffset1;                    /*!< YUV2RGB post offset 1 */
    uint16_t postOffset2;                    /*!< YUV2RGB post offset 2 */
    uint16_t matrix00;                       /*!< YUV2RGB matrix 00 */
    uint16_t matrix01;                       /*!< YUV2RGB matrix 01 */
    uint16_t matrix02;                       /*!< YUV2RGB matrix 02 */
    uint16_t matrix10;                       /*!< YUV2RGB matrix 10 */
    uint16_t matrix11;                       /*!< YUV2RGB matrix 11 */
    uint16_t matrix12;                       /*!< YUV2RGB matrix 12 */
    uint16_t matrix20;                       /*!< YUV2RGB matrix 20 */
    uint16_t matrix21;                       /*!< YUV2RGB matrix 21 */
    uint16_t matrix22;                       /*!< YUV2RGB matrix 22 */
}SPP_MISC_YUV2RGB_Cfg_Type;

/**
 *  @brief RGB2YUV configuration strcut definition
 */
typedef struct {
    BL_Fun_Type enable;                      /*!< Enable or disable rgb2yuv function */
    uint16_t preOffset0;                     /*!< RGB2YUV pre offset 0 */
    uint16_t preOffset1;                     /*!< RGB2YUV pre offset 1 */
    uint16_t preOffset2;                     /*!< RGB2YUV pre offset 2 */
    uint16_t postOffset0;                    /*!< RGB2YUV post offset 0 */
    uint16_t postOffset1;                    /*!< RGB2YUV post offset 1 */
    uint16_t postOffset2;                    /*!< RGB2YUV post offset 2 */
    uint16_t matrix00;                       /*!< RGB2YUV matrix 00 */
    uint16_t matrix01;                       /*!< RGB2YUV matrix 01 */
    uint16_t matrix02;                       /*!< RGB2YUV matrix 02 */
    uint16_t matrix10;                       /*!< RGB2YUV matrix 10 */
    uint16_t matrix11;                       /*!< RGB2YUV matrix 11 */
    uint16_t matrix12;                       /*!< RGB2YUV matrix 12 */
    uint16_t matrix20;                       /*!< RGB2YUV matrix 20 */
    uint16_t matrix21;                       /*!< RGB2YUV matrix 21 */
    uint16_t matrix22;                       /*!< RGB2YUV matrix 22 */
}SPP_MISC_RGB2YUV_Cfg_Type;

/**
 *  @brief Scaler configuration strcut definition
 */
typedef struct {
    uint16_t inputWidth;                     /*!< Width of input frame */
    uint16_t inputHeight;                    /*!< Height of input frame */
    uint16_t outputWidth;                    /*!< Width of output frame */
    uint16_t outputHeight;                   /*!< Height of output frame */
}SPP_MISC_Scaler_Cfg_Type;

/**
 *  @brief Scaler input type definition
 */
typedef enum {
    SPP_MISC_SCALER_SPP_OUTPUT,              /*!< Use SPP output as scaler input */
    SPP_MISC_SCALER_SPP_INPUT,               /*!< Use SPP input as scaler input */
    SPP_MISC_SCALER_OSD_0_OUTPUT,            /*!< Use OSD 0 as scaler input */
    SPP_MISC_SCALER_OSD_1_OUTPUT,            /*!< Use OSD 1 as scaler input */
    SPP_MISC_SCALER_OSD_2_OUTPUT,            /*!< Use OSD 2 as scaler input */
    SPP_MISC_SCALER_OSD_3_OUTPUT,            /*!< Use OSD 3 as scaler input */
    SPP_MISC_SCALER_DVP_2X_OUTPUT,           /*!< Use DVP 2X as scaler input */
}SPP_MISC_Scaler_Input_Type;


/**
 *  @brief DVP TSRC data source type definition
 */
typedef enum {
    SPP_MISC_TSRC_SOURCE_DVP, /*!< DVP TSRC data source is DVP */
    SPP_MISC_TSRC_SOURCE_CSI, /*!< DVP TSRC data source is MIPI CSI */
}SPP_MISC_TSRC_Source_Type;


/**
 *  @brief Scaler id type definition
 */
typedef enum {
    SPP_MISC_SCALER_0_ID,                    /*!< Scaler 0 port define */
    SPP_MISC_SCALER_1_ID,                    /*!< Scaler 1 port define */
    SPP_MISC_SCALER_2_ID,                    /*!< Scaler 2 port define */
    SPP_MISC_SCALER_3_ID,                    /*!< Scaler 3 port define */
    SPP_MISC_SCALER_ID_MAX,                  /*!< Scaler max ID define */
}SPP_MISC_Scaler_ID_Type;

/**
 *  @brief Crop id type definition
 */
typedef enum {
    SPP_MISC_CROP_0_ID,                      /*!< Crop 0 port define */
    SPP_MISC_CROP_1_ID,                      /*!< Crop 1 port define */
    SPP_MISC_CROP_2_ID,                      /*!< Crop 2 port define */
    SPP_MISC_CROP_3_ID,                      /*!< Crop 3 port define */
    SPP_MISC_CROP_ID_MAX,                    /*!< Crop max ID define */
}SPP_MISC_Crop_ID_Type;

/**
 *  @brief CAM id type definition
 */
typedef enum {
    SPP_MISC_CAM_0_ID,                       /*!< CAM 0 port define */
    SPP_MISC_CAM_1_ID,                       /*!< CAM 1 port define */
    SPP_MISC_CAM_2_ID,                       /*!< CAM 2 port define */
    SPP_MISC_CAM_3_ID,                       /*!< CAM 3 port define */
    SPP_MISC_CAM_4_ID,                       /*!< CAM 4 port define */
    SPP_MISC_CAM_5_ID,                       /*!< CAM 5 port define */
    SPP_MISC_CAM_6_ID,                       /*!< CAM 6 port define */
    SPP_MISC_CAM_7_ID,                       /*!< CAM 7 port define */
    SPP_MISC_CAM_ID_MAX,                     /*!< CAM max ID define */
}SPP_MISC_CAM_ID_Type;

/**
 *  @brief CAM input type definition
 */
typedef enum {
    SPP_MISC_CAM_SPP_INPUT,                  /*!< Use SPP input as CAM input */
    SPP_MISC_CAM_ACTIVE_DVP_OUTPUT,          /*!< Use active DVP(TG) as CAM input */
    SPP_MISC_CAM_DEFECT_CORRECT_OUTPUT,      /*!< Use defect correct as CAM input */
    SPP_MISC_CAM_RESERVE0_R_OUTPUT,          /*!< Use RESERVE0 R as CAM input */
    SPP_MISC_CAM_RESERVE0_G_OUTPUT,          /*!< Use RESERVE0 G as CAM input */
    SPP_MISC_CAM_RESERVE0_B_OUTPUT,          /*!< Use RESERVE0 B as CAM input */
    SPP_MISC_CAM_RESERVE1_R_OUTPUT,          /*!< Use RESERVE1 R as CAM input */
    SPP_MISC_CAM_RESERVE1_G_OUTPUT,          /*!< Use RESERVE1 G as CAM input */
    SPP_MISC_CAM_NONE_OUTPUT,                /*!< Don't use */
    SPP_MISC_CAM_RESERVE2_OUTPUT,            /*!< Use RESERVE2 as CAM input */
    SPP_MISC_CAM_RESERVE3_OUTPUT,            /*!< Use RESERVE3 as CAM input */
    SPP_MISC_CAM_RESERVE4_OUTPUT,            /*!< Use RESERVE4 as CAM input */
    SPP_MISC_CAM_SPP_OUTPUT,                 /*!< Use SPP output as CAM input */
    SPP_MISC_CAM_OSD_0_OUTPUT,               /*!< Use OSD 0 as CAM input */
    SPP_MISC_CAM_OSD_1_OUTPUT,               /*!< Use OSD 1 as CAM input */
    SPP_MISC_CAM_OSD_2_OUTPUT,               /*!< Use OSD 2 as CAM input */
    SPP_MISC_CAM_OSD_3_OUTPUT,               /*!< Use OSD 3 as CAM input */
    SPP_MISC_CAM_SCALER_0_OUTPUT,            /*!< Use scaler 0 as CAM input */
    SPP_MISC_CAM_SCALER_1_OUTPUT,            /*!< Use scaler 1 as CAM input */
    SPP_MISC_CAM_SCALER_2_OUTPUT,            /*!< Use scaler 2 as CAM input */
    SPP_MISC_CAM_SCALER_3_OUTPUT,            /*!< Use scaler 3 as CAM input */
    SPP_MISC_CAM_ADJUST_0_OUTPUT,            /*!< Use adjust 0 as CAM input */
    SPP_MISC_CAM_ADJUST_1_OUTPUT,            /*!< Use adjust 1 as CAM input */
    SPP_MISC_CAM_ADJUST_2_OUTPUT,            /*!< Use adjust 2 as CAM input */
    SPP_MISC_CAM_ADJUST_3_OUTPUT,            /*!< Use adjust 3 as CAM input */
    SPP_MISC_CAM_YUV420_0_OUTPUT,            /*!< Use YUV420 0 as CAM input */
    SPP_MISC_CAM_YUV420_1_OUTPUT,            /*!< Use YUV420 1 as CAM input */
    SPP_MISC_CAM_YUV420_2_OUTPUT,            /*!< Use YUV420 2 as CAM input */
    SPP_MISC_CAM_YUV420_3_OUTPUT,            /*!< Use YUV420 3 as CAM input */
    SPP_MISC_CAM_RESERVE5_B_OUTPUT,          /*!< Use RESERVE5 B as CAM input */
    SPP_MISC_CAM_RESERVE6_Y_OUTPUT,          /*!< Use RESERVE6 Y as CAM input */
    SPP_MISC_CAM_RESERVE6_U_OUTPUT,          /*!< Use RESERVE6 U as CAM input */
    SPP_MISC_CAM_RESERVE6_V_OUTPUT,          /*!< Use RESERVE6 V as CAM input */
    SPP_MISC_CAM_RESERVE7_OUTPUT,            /*!< Use RESERVE7 as CAM input */
    SPP_MISC_CAM_YUV2RGB_OUTPUT = 35,        /*!< Use YUV2RGB as CAM input */
    SPP_MISC_CAM_DVP2X_OUTPUT = 36,          /*!< Use DVP2X as CAM input */
}SPP_MISC_CAM_Input_Type;


/**
 *  @brief SPP MISC interrupt type definition
 */
typedef enum {
    SPP_MISC_INT_OSD_PB,  /*!< OSD probe interrupt */
    SPP_MISC_INT_SEOF0,   /*!< S/E-oF 0 interrupt */
    SPP_MISC_INT_SEOF1,   /*!< S/E-oF 1 interrupt */
    SPP_MISC_INT_SEOF2,   /*!< S/E-oF 2 interrupt */
    SPP_MISC_INT_DISPLAY, /*!< Display S/E-oF 0 interrupt */
    SPP_MISC_INT_SEOF3,   /*!< S/E-oF 3 interrupt */
    SPP_MISC_INT_ALL,     /*!< All the interrupt */
} SPP_MISC_INT_Type;

/**
 *  @brief SEOF interrupt vsync source type definition
 */
typedef enum {
    SPP_MISC_SEOF_VSYNC_SENSOR = 0,     /*!< Use sensor vsync as SEOF vsync source */
    SPP_MISC_SEOF_VSYNC_SPP_ACT = 1,    /*!< Use isp active vsync as SEOF vsync source */
    SPP_MISC_SEOF_VSYNC_SPP_OUT = 2,    /*!< Use isp out vsync as SEOF vsync source */
    SPP_MISC_SEOF_VSYNC_DVP_TSRC = 3,   /*!< Use dvp tsrc vsync as SEOF vsync source */
    SPP_MISC_SEOF_DISPLAY_TEST_SRC = 0, /*!< Use display test source as display SEOF vsync source */
    SPP_MISC_SEOF_DISPLAY_OUTPUT = 1,   /*!< Use display output as display SEOF vsync source */
} SPP_MISC_SEOF_Source_Type;

/**
 *  @brief SEOF interrupt trigger vsync edge type definition
 */
typedef enum {
    SPP_MISC_SEOF_VSYNC_NEGEDGE, /*!< Vsync negedge will trigger interrupt */
    SPP_MISC_SEOF_VSYNC_POSEDGE, /*!< Vsync posedge will trigger interrupt */
} SPP_MISC_SEOF_Edge_Type;

/**
 *  @brief YUV2RGB id type definition
 */
typedef enum {
    SPP_MISC_YUV2RGB_DISPLAY_ID,             /*!< Display YUV2RGB port define, disp_y2r*/
    SPP_MISC_YUV2RGB_NORMAL_ID,              /*!< Normal YUV2RGB port define, y2rA */
    SPP_MISC_YUV2RGB_ID_MAX,                 /*!< YUV2RGB max ID define */
}SPP_MISC_YUV2RGB_ID_Type;

/** @defgroup  SPP_MISC_CAM_ID_TYPE
 *  @{
 */
#define IS_SPP_MISC_CAM_ID_TYPE(type)                    (((type) == SPP_MISC_CAM_0_ID) || \
                                                          ((type) == SPP_MISC_CAM_1_ID) || \
                                                          ((type) == SPP_MISC_CAM_2_ID) || \
                                                          ((type) == SPP_MISC_CAM_3_ID) || \
                                                          ((type) == SPP_MISC_CAM_4_ID) || \
                                                          ((type) == SPP_MISC_CAM_5_ID) || \
                                                          ((type) == SPP_MISC_CAM_6_ID) || \
                                                          ((type) == SPP_MISC_CAM_7_ID) || \
                                                          ((type) == SPP_MISC_CAM_ID_MAX))

/** @defgroup  SPP_MISC_SCALER_ID_TYPE
 *  @{
 */
#define IS_SPP_MISC_SCALER_ID_TYPE(type)                 (((type) == SPP_MISC_SCALER_0_ID) || \
                                                          ((type) == SPP_MISC_SCALER_1_ID) || \
                                                          ((type) == SPP_MISC_SCALER_2_ID) || \
                                                          ((type) == SPP_MISC_SCALER_3_ID) || \
                                                          ((type) == SPP_MISC_SCALER_ID_MAX))

/** @defgroup  SPP_MISC_TSRC_SOURCE_TYPE
 *  @{
 */
#define IS_SPP_MISC_TSRC_SOURCE_TYPE(type) (((type) == SPP_MISC_TSRC_SOURCE_DVP) || \
                                            ((type) == SPP_MISC_TSRC_SOURCE_CSI))


/** @defgroup  SPP_MISC_OSD_ID_TYPE
 *  @{
 */
#define IS_SPP_MISC_OSD_ID_TYPE(type)                    (((type) == SPP_MISC_OSD_0_ID) || \
                                                          ((type) == SPP_MISC_OSD_1_ID) || \
                                                          ((type) == SPP_MISC_OSD_2_ID) || \
                                                          ((type) == SPP_MISC_OSD_3_ID) || \
                                                          ((type) == SPP_MISC_OSD_ID_MAX))

/** @defgroup  SPP_MISC_ADJUST_ID_TYPE
 *  @{
 */
#define IS_SPP_MISC_ADJUST_ID_TYPE(type)                 (((type) == SPP_MISC_ADJUST_0_ID) || \
                                                          ((type) == SPP_MISC_ADJUST_1_ID) || \
                                                          ((type) == SPP_MISC_ADJUST_2_ID) || \
                                                          ((type) == SPP_MISC_ADJUST_3_ID) || \
                                                          ((type) == SPP_MISC_ADJUST_ID_MAX))

/** @defgroup  SPP_MISC_YUV2RGB_ID_TYPE
 *  @{
 */
#define IS_SPP_MISC_YUV2RGB_ID_TYPE(type)                (((type) == SPP_MISC_YUV2RGB_DISPLAY_ID) || \
                                                          ((type) == SPP_MISC_YUV2RGB_NORMAL_ID) || \
                                                          ((type) == SPP_MISC_YUV2RGB_ID_MAX))

/** @defgroup  SPP_MISC_CAM_INPUT_TYPE
 *  @{
 */
#define IS_SPP_MISC_CAM_INPUT_TYPE(type)                 (((type) == SPP_MISC_CAM_SPP_INPUT) || \
                                                          ((type) == SPP_MISC_CAM_ACTIVE_DVP_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_DEFECT_CORRECT_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE0_R_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE0_G_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE0_B_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE1_R_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE1_G_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_NONE_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE2_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE3_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE4_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_SPP_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_OSD_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_OSD_1_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_OSD_2_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_OSD_3_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_SCALER_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_SCALER_1_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_SCALER_2_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_SCALER_3_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_ADJUST_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_ADJUST_1_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_ADJUST_2_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_ADJUST_3_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_YUV420_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_YUV420_1_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_YUV420_2_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_YUV420_3_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE5_B_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE6_Y_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE6_U_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE6_V_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_YUV2RGB_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_DVP2X_OUTPUT) || \
                                                          ((type) == SPP_MISC_CAM_RESERVE7_OUTPUT))

/** @defgroup  SPP_MISC_SCALER_INPUT_TYPE
 *  @{
 */
#define IS_SPP_MISC_SCALER_INPUT_TYPE(type)              (((type) == SPP_MISC_SCALER_SPP_OUTPUT) || \
                                                          ((type) == SPP_MISC_SCALER_SPP_INPUT) || \
                                                          ((type) == SPP_MISC_SCALER_OSD_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_SCALER_OSD_1_OUTPUT) || \
                                                          ((type) == SPP_MISC_SCALER_OSD_2_OUTPUT) || \
                                                          ((type) == SPP_MISC_SCALER_OSD_3_OUTPUT) || \
                                                          ((type) == SPP_MISC_SCALER_DVP_2X_OUTPUT))

