bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Inc/bl808_spp_misc.h
/** @defgroup  SPP_MISC_OSD_INPUT_TYPE
 *  @{
 */
#define IS_SPP_MISC_OSD_INPUT_TYPE(type)                 (((type) == SPP_MISC_OSD_SPP_OUTPUT) || \
                                                          ((type) == SPP_MISC_OSD_SPP_INPUT) || \
                                                          ((type) == SPP_MISC_OSD_SCALER_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_OSD_SCALER_1_OUTPUT) || \
                                                          ((type) == SPP_MISC_OSD_SCALER_2_OUTPUT) || \
                                                          ((type) == SPP_MISC_OSD_SCALER_3_OUTPUT) || \
                                                          ((type) == SPP_MISC_OSD_OSD_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_OSD_DVP_2X_OUTPUT))
/** @defgroup  SPP_MISC_OSD_PB_INPUT_TYPE
 *  @{
 */
#define IS_SPP_MISC_OSD_PB_INPUT_TYPE(type)              (((type) == SPP_MISC_OSD_PB_SPP_OUTPUT) || \
                                                          ((type) == SPP_MISC_OSD_PB_SPP_INPUT))

/** @defgroup  SPP_MISC_YUV2RGB_INPUT_TYPE
 *  @{
 */
#define IS_SPP_MISC_YUV2RGB_INPUT_TYPE(type)             (((type) == SPP_MISC_YUV2RGB_SPP_OUTPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_SPP_INPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_OSD_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_OSD_1_OUTPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_OSD_2_OUTPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_OSD_3_OUTPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_SCALER_0_OUTPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_SCALER_1_OUTPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_SCALER_2_OUTPUT) || \
                                                          ((type) == SPP_MISC_YUV2RGB_SCALER_3_OUTPUT))

/** @defgroup  SPP_MISC_BAYER_SHIFT_TYPE
 *  @{
 */
#define IS_SPP_MISC_BAYER_SHIFT_TYPE(type)               (((type) == SPP_MISC_BAYER_SHIFT_LEFT) || \
                                                          ((type) == SPP_MISC_BAYER_SHIFT_RIGHT))

/** @defgroup  SPP_MISC_INT_TYPE
 *  @{
 */
#define IS_SPP_MISC_INT_TYPE(type) (((type) == SPP_MISC_INT_OSD_PB) ||  \
                                    ((type) == SPP_MISC_INT_SEOF0) ||   \
                                    ((type) == SPP_MISC_INT_SEOF1) ||   \
                                    ((type) == SPP_MISC_INT_SEOF2) ||   \
                                    ((type) == SPP_MISC_INT_DISPLAY) || \
                                    ((type) == SPP_MISC_INT_SEOF3) ||   \
                                    ((type) == SPP_MISC_INT_ALL))
/** @defgroup  SPP_MISC_SEOF_SOURCE_TYPE
 *  @{
 */
#define IS_SPP_MISC_SEOF_SOURCE_TYPE(type) (((type) == SPP_MISC_SEOF_VSYNC_SENSOR) ||     \
                                            ((type) == SPP_MISC_SEOF_VSYNC_SPP_ACT) ||    \
                                            ((type) == SPP_MISC_SEOF_VSYNC_SPP_OUT) ||    \
                                            ((type) == SPP_MISC_SEOF_VSYNC_DVP_TSRC) ||    \
                                            ((type) == SPP_MISC_SEOF_DISPLAY_TEST_SRC) || \
                                            ((type) == SPP_MISC_SEOF_DISPLAY_OUTPUT))




/** @defgroup  SPP_MISC_SEOF_EDGE_TYPE
 *  @{
 */
#define IS_SPP_MISC_SEOF_EDGE_TYPE(type)                 (((type) == SPP_MISC_SEOF_VSYNC_NEGEDGE) || \
                                                          ((type) == SPP_MISC_SEOF_VSYNC_POSEDGE))

/** @defgroup  SPP_MISC_DISPLAY_INPUT_TYPE
 *  @{
 */
#define IS_SPP_MISC_DISPLAY_INPUT_TYPE(type)             (((type) == SPP_MISC_DISPLAY_YUV2RGB_OUTPUT) || \
                                                          ((type) == SPP_MISC_DISPLAY_YUV422_OUTPUT))

/*@} end of group SPP_MISC_Public_Constants */

/** @defgroup  SPP_MISC_CROP_ID_TYPE
 *  @{
 */
#define IS_SPP_MISC_CROP_ID_TYPE(type)                   (((type) == SPP_MISC_CROP_0_ID) || \
                                                          ((type) == SPP_MISC_CROP_1_ID) || \
                                                          ((type) == SPP_MISC_CROP_2_ID) || \
                                                          ((type) == SPP_MISC_CROP_3_ID) || \
                                                          ((type) == SPP_MISC_CROP_ID_MAX))

/** @defgroup  DVP_DATA_ORDER_TYPE
 *  @{
 */
#define IS_DVP_DATA_ORDER_TYPE(type)                     (((type) == SPP_MISC_2X_DATA_BYTE_LOWER) || \
                                                          ((type) == SPP_MISC_2X_DATA_BYTE_HIGHER))

/** @defgroup  DVP_ACTIVE_LEVEL_TYPE
 *  @{
 */
#define IS_DVP_ACTIVE_LEVEL_TYPE(type)                   (((type) == SPP_MISC_ACTIVE_HIGH) || \
                                                          ((type) == SPP_MISC_ACTIVE_LOW))
void Display_IRQHandler(void);
void SPP_MISC_Int_Callback_Install(SPP_MISC_INT_Type intType, intCallback_Type *cbFun);
void SPP_MISC_Int_Mask(SPP_MISC_INT_Type intType, BL_Mask_Type intMask);
void SPP_MISC_Int_Clear_1(SPP_MISC_INT_Type intType);
void SPP_MISC_SEOF_Set_Source(SPP_MISC_INT_Type intType, SPP_MISC_SEOF_Source_Type source);
void SPP_MISC_SEOF_Set_Edge(SPP_MISC_INT_Type intType, SPP_MISC_SEOF_Edge_Type edge);
void SPP_Misc_Config(SPP_DVP_BIT_DEPTH_E dvp_bits);
void SPP_DVP2AXI_Set_Src(DVP2AXI_Port_Type dvp2axi, DVP2AXI_Src_Type sel);
void SPP_DVP2AXI_Get_Src(DVP2AXI_Port_Type dvp2axi, DVP2AXI_Src_Type *sel);
void SPP_DVP2AXI_Set_Id_Sel(DVP2AXI_Port_Type dvp2axi, DVP2AXI_ID_E id);
void SPP_DVP2AXI_Get_Id_Sel(DVP2AXI_Port_Type dvp2axi, DVP2AXI_ID_E *id);

void SPP_MISC_TSRC_Source_Select(SPP_MISC_TSRC_Source_Type sourceType);

void SPP_Intr_Ctrl_Init(void);
void SPP_Intr_Ctrl_Set_Src(SPP_SEOF_E seof,SPP_Seof_Intr_Src_Type selection);
void SPP_Intr_Ctrl_Get_Src(SPP_SEOF_E seof, SPP_Seof_Intr_Src_Type *selection);
void SPP_Scaler_Set_State(SPP_Scaler_Type type, BL_Fun_Type state);
void SPP_Scaler_Set_Cfg(SPP_Scaler_Type scaler, SPP_SCALER_CONFIG_S *scaler_conf);
void SPP_Frame_M_to_N(SPP_FRAME_M_TO_N_S *cfg);
void SPP_Frame_Get_M_to_N(SPP_FRAME_M_TO_N_S *cfg);
void SPP_Enable_BL_SPP_Back(void);

void SPP_YUV_Adjust_Init();
void SPP_YUV_Adjust_Set_Cfg(SPP_YUV_Adjust_Type id, SPP_YUV_Adjust_Cfg_Type *cfg);
void SPP_YUV_Adjust_Get_Cfg(SPP_YUV_Adjust_Type id, SPP_YUV_Adjust_Cfg_Type *cfg);
void SPP_YUV_Adjust_Set_State(SPP_YUV_Adjust_Type type, BL_Fun_Type state);
void SPP_YUV_Adjust_Get_State(SPP_YUV_Adjust_Type type, BL_Fun_Type *state);
void SPP_YUV_Adjust_Set_Input(SPP_YUV_Adjust_Type type, SPP_YUV_Adjust_Input input);
void SPP_YUV_Adjust_Get_Input(SPP_YUV_Adjust_Type type, SPP_YUV_Adjust_Input *input);

void SPP_MISC_OSD_Input_Select(SPP_MISC_OSD_ID_Type osdId,SPP_MISC_OSD_Input_Type inputType);
void SPP_MISC_OSD_Get_Input_Select(SPP_MISC_OSD_ID_Type osdId,SPP_MISC_OSD_Input_Type *inputType);
void SPP_MISC_OSD_Pb_Input_Select(SPP_MISC_OSD_PB_Input_Type inputType);
void SPP_MISC_OSD_Pb_Get_Input_Select(SPP_MISC_OSD_PB_Input_Type *inputType);
void SPP_MISC_Bayer_Shift(uint16_t bitEnable,SPP_MISC_Bayer_Shift_Type shiftType,uint8_t bitShift);

void SPP_MISC_Scaler_Init(SPP_MISC_Scaler_ID_Type scalerId,SPP_MISC_Scaler_Cfg_Type* scalerCfg);
void SPP_MISC_Scaler_Get_Cfg(SPP_MISC_Scaler_ID_Type scalerId,SPP_MISC_Scaler_Cfg_Type* scalerCfg);
void SPP_MISC_Scaler_Input_Select(SPP_MISC_Scaler_ID_Type scalerId,SPP_MISC_Scaler_Input_Type inputType);
void SPP_MISC_Scaler_Get_Input_Select(SPP_MISC_Scaler_ID_Type scalerId,SPP_MISC_Scaler_Input_Type *inputType);
void SPP_MISC_Scaler_Enable(SPP_MISC_Scaler_ID_Type scalerId);
void SPP_MISC_Scaler_Disable(SPP_MISC_Scaler_ID_Type scalerId);
void SPP_MISC_Scaler_Get_State(SPP_MISC_Scaler_ID_Type scalerId, BL_Fun_Type *state);
void SPP_MISC_Scaler_Sh_Enable(SPP_MISC_Scaler_ID_Type scalerId);
void SPP_MISC_Scaler_Sh_Disable(SPP_MISC_Scaler_ID_Type scalerId);

void SPP_MISC_YUV2RGB_Init(SPP_MISC_YUV2RGB_ID_Type yuv2rgbId,SPP_MISC_YUV2RGB_Cfg_Type* yuv2rgbCfg);
void SPP_MISC_YUV2RGB_Get_Cfg(SPP_MISC_YUV2RGB_ID_Type yuv2rgbId,SPP_MISC_YUV2RGB_Cfg_Type* yuv2rgbCfg);

void SPP_MISC_CAM_Input_Select(SPP_MISC_CAM_ID_Type camId,SPP_MISC_CAM_Input_Type inputType);

