bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Inc/bl808_spp_misc.h
void SPP_MISC_Display_Init(SPP_MISC_Display_Cfg_Type* displayCfg);
void SPP_MISC_Display_Get_Cfg(SPP_MISC_Display_Cfg_Type* displayCfg);
void SPP_MISC_Display_Set_Clk_Output_Inv(int value);
void SPP_MISC_Display_Get_Clk_Output_Inv(int *value);
void SPP_MISC_Display_RGB2YUV_Set_Cfg(SPP_MISC_RGB2YUV_Cfg_Type* rgb2yuvCfg);
void SPP_MISC_Display_RGB2YUV_Get_Cfg(SPP_MISC_RGB2YUV_Cfg_Type* rgb2yuvCfg);

void SPP_Scaler_Set_Input(SPP_Scaler_Type type, SPP_Scaler_Input input);
void SPP_Scaler_Get_Input(SPP_Scaler_Type type, SPP_Scaler_Input *input);
void SPP_OSD_Set_Input(SPP_OSD_Type type, SPP_OSD_Input input);
void SPP_OSD_Get_Input(SPP_OSD_Type type, SPP_OSD_Input *input);
void SPP_YUV2RGB_Set_Input(SPP_YUV2RGB_Type type, SPP_YUV2RGB_Input input);
void SPP_YUV2RGB_Get_Input(SPP_YUV2RGB_Type type, SPP_YUV2RGB_Input *input);
void SPP_YUV2RGB_Init(SPP_YUV2RGB_Param type);

void SPP_MISC_Crop_Init(SPP_MISC_Crop_ID_Type cropId,SPP_MISC_Crop_Cfg_Type* cropCfg);
void SPP_MISC_Crop_Get_Cfg(SPP_MISC_Crop_ID_Type cropId, SPP_MISC_Crop_Cfg_Type* cropCfg);
void SPP_MISC_Crop_Enable(SPP_MISC_Crop_ID_Type cropId);
void SPP_MISC_Crop_Disable(SPP_MISC_Crop_ID_Type cropId);
void SPP_MISC_Crop_Get_State(SPP_MISC_Crop_ID_Type cropId, BL_Fun_Type *state);
void SPP_MSIC_DVP_2x_Init(DVP_2x_Cfg_Type* dvp2xCfg);
void SPP_MSIC_DVP_2x_Get_Cfg(DVP_2x_Cfg_Type* dvp2xCfg);
void SPP_MSIC_DVP_2x_Enable(void);
void SPP_MSIC_DVP_2x_Disable(void);
void SPP_MSIC_DVP_2x_Get_State(BL_Fun_Type *state);
void SPP_MSIC_Pclk_Force_Set_State(BL_Fun_Type state);
void SPP_MSIC_Pclk_Force_Get_State(BL_Fun_Type *state);
void SPP_MSIC_Cr_De_As_Hsync_Set_State(BL_Fun_Type state);
void SPP_MSIC_Cr_De_As_Hsync_Get_State(BL_Fun_Type *state);
void SPP_MSIC_Dtsrc_Set_Mode(SPP_DTSRC_SRC_E mode);
void SPP_MSIC_Dtsrc_Get_Mode(SPP_DTSRC_SRC_E *mode);

/* DVP reshape */
void SPP_MISC_Reshape_Set_State(BL_Fun_Type state);
void SPP_MISC_Reshape_Get_State(BL_Fun_Type *state);
void SPP_MISC_Reshape_Counter_Clear();
void SPP_MISC_Reshape_Set_Counter(int value);
void SPP_MISC_Reshape_Get_Counter(int *value);
void SPP_MISC_Reshape_Set_HSync_Inv(BL_Fun_Type state);
void SPP_MISC_Reshape_Get_HSync_Inv(BL_Fun_Type *state);
void SPP_MISC_Reshape_Set_VSync_Inv(BL_Fun_Type state);
void SPP_MISC_Reshape_Get_VSync_Inv(BL_Fun_Type *state);

#endif //__BL808_SPP_MISC_H__
